// @strict-types

#Область ПрограммныйИнтерфейс

// Создает пользователя-администратора при первом запуске информационной базы, если в ней отсутствуют пользователи.
Процедура ДействияПриПервомЗапуске() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда
		
		ДанныеПользователя = ПользователиСервер.ДанныеПользователя();
		ДанныеПользователя.ИмяПользователя = "Администратор";
		ДанныеПользователя.Пароль = "123";
		ПользователиСервер.СоздатьПользователяАдминистратор(ДанныеПользователя);
		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
