// @strict-types

#Область ПрограммныйИнтерфейс

Процедура ДействияПриПервомЗапуске() Экспорт
	
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда
		
		ДанныеПользователя = ПользователиСервер.ДанныеПользователя();
		ДанныеПользователя.ИмяПользователя = "Администратор";
		ДанныеПользователя.Пароль = "123";
		ПользователиСервер.СоздатьПользователяАдминистратор(ДанныеПользователя);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
