// @strict-types


#Область ПрограммныйИнтерфейс

// Выводит пользователю сообщение с помощью системного механизма уведомлений.
//
// Параметры:
//   ТекстСообщения - Строка
Процедура СообщитьПользователю(ТекстСообщения) Экспорт
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = ТекстСообщения;
	СообщениеПользователю.Сообщить();

КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
