// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьПользователя(Команда)
	
	Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда
		ИнтерфейсныеФункцииКлиентСервер.СообщитьПользователю("Необходимо указать имя пользователя");
		Возврат;
	КонецЕсли;
	
	СоздатьПользователяНаСервере(ИмяПользователя);
	ИмяПользователя = "";
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СоздатьПользователяНаСервере(ИмяПользователя)
	
	НайденныйПользователь = ПользователиСервер.НайтиПользователяПоИмени(ИмяПользователя);
	
	Если ЗначениеЗаполнено(НайденныйПользователь) Тогда
		ИнтерфейсныеФункцииКлиентСервер.СообщитьПользователю("Пользователь с именем """ + ИмяПользователя + """ уже существует");
		Возврат;
	КонецЕсли;
	
	ДанныеПользователя = ПользователиСервер.ДанныеПользователя();
	ДанныеПользователя.ИмяПользователя = ИмяПользователя;
	ДанныеПользователя.Пароль = "123456"; // Стандартный пароль
	
	НовыйПользователь = ПользователиСервер.СоздатьПользователя(ДанныеПользователя);
	
	ИнтерфейсныеФункцииКлиентСервер.СообщитьПользователю("Пользователь """ + ИмяПользователя + """ успешно создан");
	
КонецПроцедуры

#КонецОбласти
