// @strict-types

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры <> Неопределено И ТребуемыеПараметры.Найти("Пользователь") <> Неопределено Тогда
			
		ТекущийПользователь_Установить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ТекущийПользователь_Установить()
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Пользователь = ПользователиСервер.НайтиПользователяПоИмени(ИмяПользователя());
		Если ЗначениеЗаполнено(Пользователь) Тогда
			ПараметрыСеанса.ТекущийПользователь = Пользователь;
		Иначе
			ВызватьИсключение "Не установлен текущий пользователь";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


