// @strict-types

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		
		ТекущийПользователь_Установить();
		
	ИначеЕсли ТребуемыеПараметры.Найти("Пользователь") <> Неопределено Тогда
			
		ТекущийПользователь_Установить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ТекущийПользователь_Установить()
	
	Пользователь = ПользователиСервер.НайтиПользователяПоИмени(ИмяПользователя());
	Если ЗначениеЗаполнено(Пользователь) Тогда
		ПараметрыСеанса.ТекущийПользователь = Пользователь;
	Иначе
		ВызватьИсключение "Не установлен текущий пользователь";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


