// @strict-types

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено ИЛИ ТребуемыеПараметры.Найти("Пользователь") <> Неопределено Тогда
		ТекущийПользователь_Установить();
	КонецЕсли;
	
	Если ТребуемыеПараметры = Неопределено ИЛИ ТребуемыеПараметры.Найти("ПользовательИспользование") <> Неопределено Тогда
		ПользовательИспользование_Установить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ТекущийПользователь_Установить()
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Пользователь = ПользователиСервер.НайтиПользователяПоИмени(ИмяПользователя());
		Если ЗначениеЗаполнено(Пользователь) Тогда
			ПараметрыСеанса.ТекущийПользователь = Пользователь;
		Иначе
			ВызватьИсключение "Не установлен текущий пользователь";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПользовательИспользование_Установить()
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ПараметрыСеанса.ПользовательИспользование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


