// @strict-types


#Область ПрограммныйИнтерфейс

// Возвращает пользователя справочника Пользователи по коду пользователя.
//
// Параметры:
//   ИмяПользователя - Строка - код пользователя
//
// Возвращаемое значение:
//   - СправочникСсылка.Пользователи - найденный пользователь
//   - Неопределено - если пользователь не найден
Функция НайтиПользователяПоИмени(ИмяПользователя) Экспорт
	
	НайденныйПользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
	
	Возврат НайденныйПользователь;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
