// @strict-types


#Область ПрограммныйИнтерфейс

// Возвращает пользователя справочника Пользователи по коду пользователя.
//
// Параметры:
//   ИмяПользователя - Строка - код пользователя
//
// Возвращаемое значение:
//   - СправочникСсылка.Пользователи - найденный пользователь
Функция НайтиПользователяПоИмени(ИмяПользователя) Экспорт
	
	НайденныйПользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
	
	Возврат НайденныйПользователь;
	
КонецФункции

// Создает пользователя информационной базы и элемент справочника "Пользователи"
//
// Параметры:
//   ДанныеПользователя - Структура:
//     * ИмяПользователя - Строка - имя пользователя
//     * Пароль - Строка - пароль пользователя
//     
// Возвращаемое значение:
//   СправочникСсылка.Пользователи - ссылка на созданный элемент справочника
Функция СоздатьПользователя_Пользователь(ДанныеПользователя) Экспорт
	
	Возврат СоздатьПользователя(ДанныеПользователя);

КонецФункции

// Создает пользователя-администратора информационной базы и элемент справочника "Пользователи"
//
// Параметры:
//   ДанныеПользователя - Структура:
//     * ИмяПользователя - Строка - имя пользователя
//     * Пароль - Строка - пароль пользователя
//     * Роли - Массив из ОбъектМетаданныхРоль - массив ролей пользователя
//          
// Возвращаемое значение:
//   СправочникСсылка.Пользователи - ссылка на созданный элемент справочника
Функция СоздатьПользователяАдминистратор(ДанныеПользователя) Экспорт
		
	ДанныеПользователя.Роли.Добавить(Метаданные.Роли.Пользователь);
	
	Возврат СоздатьПользователя(ДанныеПользователя);
		
КонецФункции

// Возвращает структуру с пустыми данными пользователя.
//
// Возвращаемое значение:
//   Структура:
//     * ИмяПользователя - Строка - имя пользователя
//     * Пароль - Строка - пароль пользователя
//     * Роли - Массив из ОбъектМетаданныхРоль - массив ролей пользователя
Функция ДанныеПользователя() Экспорт
	
	ДанныеПользователя = Новый Структура;
	ДанныеПользователя.Вставить("ИмяПользователя", "");
	ДанныеПользователя.Вставить("Пароль", "");
	ДанныеПользователя.Вставить("Роли", Новый Массив);
	
	Возврат ДанныеПользователя;
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//
// Параметры:
//   ДанныеПользователя - Структура:
//     * ИмяПользователя - Строка - имя пользователя
//     * Пароль - Строка - пароль пользователя
//     * Роли - Массив из ОбъектМетаданныхРоль - массив ролей пользователя
//     
// Возвращаемое значение:
//   СправочникСсылка.Пользователи - ссылка на созданный элемент справочника
Функция СоздатьПользователя(ДанныеПользователя) Экспорт
	
	// Создаем пользователя 1С
	Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	Пользователь.Имя = ДанныеПользователя.ИмяПользователя;
	Пользователь.Пароль = ДанныеПользователя.Пароль;
	Для	Каждого ТекущаяРоль из ДанныеПользователя.Роли Цикл 
		Пользователь.Роли.Добавить(ТекущаяРоль);
	КонецЦикла;
	Пользователь.Записать();
	
	// Создаем элемент справочника "Пользователи"
	ПользовательСправочник = Справочники.Пользователи.СоздатьЭлемент();
	ПользовательСправочник.Наименование = ДанныеПользователя.ИмяПользователя;
	ПользовательСправочник.Код = ДанныеПользователя.ИмяПользователя;
	ПользовательСправочник.Записать();
	
	Возврат ПользовательСправочник.Ссылка;

КонецФункции

#КонецОбласти
