// @strict-types


#Область ПрограммныйИнтерфейс

// Возвращает пользователя справочника Пользователи по коду пользователя.
//
// Параметры:
//   ИмяПользователя - Строка - код пользователя
//
// Возвращаемое значение:
//   - СправочникСсылка.Пользователи - найденный пользователь
Функция НайтиПользователяПоИмени(ИмяПользователя) Экспорт
	
	НайденныйПользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
	
	Возврат НайденныйПользователь;
	
КонецФункции

// Создает пользователя информационной базы и элемент справочника "Пользователи"
//
// Параметры:
//   ДанныеПользователя - Структура:
//     * ИмяПользователя - Строка - имя пользователя
//     * Пароль - Строка - пароль пользователя
//     
// Возвращаемое значение:
//   СправочникСсылка.Пользователи - ссылка на созданный элемент справочника
Функция СоздатьПользователя(ДанныеПользователя) Экспорт
	
	// Создаем пользователя 1С
	Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	Пользователь.Имя = ДанныеПользователя.ИмяПользователя;
	Пользователь.Пароль = ДанныеПользователя.Пароль;
	Пользователь.Роли.Добавить(Метаданные.Роли.Пользователь);
	Пользователь.Записать();
	
	// Создаем элемент справочника "Пользователи"
	ПользовательСправочник = Справочники.Пользователи.СоздатьЭлемент();
	ПользовательСправочник.Наименование = ДанныеПользователя.ИмяПользователя;
	ПользовательСправочник.Код = ДанныеПользователя.ИмяПользователя;
	ПользовательСправочник.Записать();
	
	Возврат ПользовательСправочник.Ссылка;

КонецФункции

// Создает пользователя-администратора информационной базы и элемент справочника "Пользователи"
//
// Параметры:
//   ДанныеПользователя - Структура:
//     * ИмяПользователя - Строка - имя пользователя
//     * Пароль - Строка - пароль пользователя
//     
// Возвращаемое значение:
//   СправочникСсылка.Пользователи - ссылка на созданный элемент справочника
Функция СоздатьПользователяАдминистратор(ДанныеПользователя) Экспорт
	
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = ДанныеПользователя.ИмяПользователя;
		Пользователь.Пароль = ДанныеПользователя.Пароль;
		Пользователь.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		Пользователь.Записать();
		
		// Создаем элемент справочника "Пользователи"
		ПользовательСправочник = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательСправочник.Наименование = ДанныеПользователя.ИмяПользователя;
		ПользовательСправочник.Код = ДанныеПользователя.ИмяПользователя;
		ПользовательСправочник.Записать();
		
		Возврат ПользовательСправочник.Ссылка;
		
КонецФункции

// Возвращает структуру с пустыми данными пользователя.
//
// Возвращаемое значение:
//   Структура:
//     * ИмяПользователя - Строка - имя пользователя
//     * Пароль - Строка - пароль пользователя
Функция ДанныеПользователя() Экспорт
	
	ДанныеПользователя = Новый Структура;
	ДанныеПользователя.Вставить("ИмяПользователя", "");
	ДанныеПользователя.Вставить("Пароль", "");
	
	Возврат ДанныеПользователя;
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
